<template>
  <div class="Wrap">
    <shellWrap :content="content">
      <img src="../../../assets/img/jingcai_fangan.png" alt="" slot="solutionImg">
    </shellWrap>
  </div>
</template>
<script>
  import shellWrap from '../../../components/shellWrap'
  export default {
    name: 'JCYC',

    data() {
      return {
        content: {

          text1: '基于区块链技术和互联网科技，通过区块链智能合约，结合现有体育赛事、福利彩票预测、电竞赛事、海选投票等竞猜预测的逻辑构建，全球用户都可以参与创建竞猜事件，' +
          '全新的商业模式。可以将区域化的、发展缓慢的竞猜预测行业，得以更广泛与快速的发展，从而达到既满足各地政府发展体育事业、慈善事业的资金需求、' +
          '同时还能吸引更多全球用户的进行参与。',

          compare: {
            title1: '传统竞猜预测系统',
            left: {
              p1: '中心化数据库，数据不安全',
              p2:'竞猜事件单一',
              p3:'区域性强，涉及本地法币支付',
              p4:'会有直接利益者控制、蓄意操控市场',
              p5:'用户个人信息泄露严重'
            },
            title2: '区块链竞猜预测系统',
            right: {
              p1: '去中心化系统，不可篡改',
              p2:'普通用户可以创建，竞猜多元化',
              p3:'不涉及法币支付，全球无障碍通行',
              p4:'去中华特性，不存在蓄意操控市场或跑路行为',
              p5:'区块链的匿名性和多层层验证，信息安全'
            }
          },

          advantageTitle: '区块链竞猜预测系统优势',
          advantage: {
            an1: {
              p1: '公开透明：',
              p2: '基于去中心化理念的，因此它不会被任何直接利益相关团体所控制。平台使用了智能合约技术，没有人能够篡改平台上的竞猜记录，操作虚假竞猜结果更加不\t\t可能实现；\n'
            },
            an2: {
              p1: '用户创立竞猜项目：',
              p2: '推出了用户创立竞猜事件的模式，对该赛事有兴趣的用户便可以参与竞猜，回报率由最终事件结果参与各方的资金比例决定。智能合约将会帮助解\t\t决陌生人之间最大的信任障碍，' +
              '同时不会产生高昂的协力厂商见证费用。在这种模式之下，竞猜事件的种类丰富，这是市场上任何竞争对手都无法做\t\t\t\t\t\t到的；\n'
            },
            an3: {
              p1: '流通：',
              p2: '只允许用户使用平台许可的加密货币进行竞猜参与，不涉及任何法定货币，在全球流通中无任何障碍；\n'
            },
            an4: {
              p1: '资金安全：',
              p2: '去中心化的特性，使用智能合约技术，将不会有操控者来控制回报率或者蓄意操控市场，因此也不会存在有操控者跑路的行为，参与竞猜的用户的投注和资产\t\t安全性得到很好的保证；\n'
            },
            an5: {
              p1: '个人资料隐私：',
              p2: '区块链在匿名性的基础上，还通过多种加密、验证方式等多种技术手段，有效地保护用户的个人隐私，安全性更高，提高其信任感；\n',
            }
          },

          scenesTitle: '区块链竞猜预测系统应用场景',
          scenesText: '区块链的优势在于它的分布式记账，去中心化去信任，时间戳和共识机制。',
          scenes: {
            lists: {
              an1: {
                img: require('../../../assets/img/jingcai_ico_1.png'),
                p1: '体育赛事<br>竞猜',
              },
              an2: {
                img: require('../../../assets/img/jingcai_ico_2.png'),
                p1: '福利彩票<br>竞猜',
              },
              an3: {
                img: require('../../../assets/img/jingcai_ico_3.png'),
                p1: '电竞赛事<br>竞猜',
              },
              an4: {
                img: require('../../../assets/img/jingcai_ico_4.png'),
                p1: '海选投票<br>竞猜',
              }
            }
          }







        }
      }
    },

    components: {
      shellWrap
    },


  }
</script>
<style scoped>

</style>
