<template>
  <div class="Wrap">
    <shellWrap :content="content">
      <img src="../../../assets/img/youxi_fangan.png" alt="" slot="solutionImg">
    </shellWrap>
  </div>
</template>
<script>
  import shellWrap from '../../../components/shellWrap'
  export default {
    name: 'QKLYX',

    data() {
      return {
        content: {

          text1: '基于区块链技术和互联网科技，通过区块链智能合约，结合现有互联网技术，改变了玩家虚拟资产流通、交易受限的局面。通过区块链将数字道具转换为加密资产，' +
          '能降低玩家交易门槛和交易风险，同时玩家的交易不再仅限于单一游戏/平台内，打破区域性限制。',

          compare: {
            title1: '传统游戏系统',
            left: {
              p1: '数据不透明，交易费用高',
              p3:'用户资产无法确权',
              p4:'中心化游戏运营公司',
              p5:'不能满足多元化需求',
              p6:'游戏经济系统孤岛效应'
            },
            title2: '区块链竞猜预测系统',
            right: {
              p1: '数据公开透明，即时付款',
              p3:'虚拟资产上链确权',
              p4:'去中心化运营，数据可信任',
              p5:'丰富多元化的玩法',
              p6:'打破孤岛经济'
            }
          },

          advantageTitle: '区块链溯源系统优势',
          advantage: {
            an1: {
              p1: '数据公开透明：',
              p2: '数据存储于区块链上，游戏运营方无法随意篡改和删除游戏里面的数据，游戏玩家也无法通过外挂作弊，游戏数据透明化、信任化、游戏更加公平公正；\n'
            },
            an2: {
              p1: '即时付款：',
              p2: '区块链技术避免了依靠第三方支付平台来管理交易的需要，间接降低用户的交易成本，使用基于区块链的货币，玩家可以在游戏中购买并几乎立即获得奖励；'
            },
            an3: {
              p1: '虚拟资产确权：',
              p2: '玩家游戏中的商品、道具使用区块链 技术存储于 区块链上，而不是存储在 游戏运营方的数据库里，真正做到玩 家在游戏中花钱购买的虚拟商品所有权属于玩家；\n'
            },
            an4: {
              p1: '去中心化运营：',
              p2: '结合区块链技术，游戏中的各系统设置使用智能 合约技术开发，游戏运营方无法滥发游戏商品和道具。同时，即使游戏关闭，玩家的商品数据存储在区块链上，不会随着游戏的关闭而消失；\n'
            },
            an5: {
              p1: '丰富多元化的玩法：',
              p2: '结合区块链技术使用可编程的智能合约设计游戏架构，自动执行智能合约；\n',
            },
            an6: {
              p1: '打破孤岛经济：',
              p2: '使用数字资产做为游戏的结算方式，极大的降低 玩家的交易手续费和交易难度。 同时玩家的数字 资产基于区块链上可全球化流通，而不再局限于游戏内，不会形成经济孤岛；\n',
            },
            an7: {
              p1: '强安全保护：',
              p2: '基于区块链技术，用户的信息和虚拟资产都存储区块链上就算游戏运营方数据库被入侵，也不会造成用户数据泄露或资产被盗用，数据安全相对于传统互联网有保障；\n' +
              '\n',
            }
          },

          scenesTitle: '区块链游戏系统应用场景',
          scenesText: '基于区块链技术，通过将虚拟产品拟物化、拟人化，结合区块链的不可篡改性和永久所有权的特点，提高玩家的互动性、趣味性，提高游戏产品的价值。',
          scenes: {
            lists: {
              an1: {
                img: require('../../../assets/img/youxi_ico_1.png'),
                p1: '卡牌类<br>游戏',
              },
              an2: {
                img: require('../../../assets/img/youxi_ico_2.png'),
                p1: '虚拟城市<br>游戏',
              },
              an3: {
                img: require('../../../assets/img/youxi_ico_3.png'),
                p1: '加密宠物<br>游戏',
              },
              an4: {
                img: require('../../../assets/img/youxi_ico_4.png'),
                p1: '角色类<br>游戏',
              }
            }
          }







        }
      }
    },

    components: {
      shellWrap
    },


  }
</script>
<style scoped>

</style>
